kusadact/STM32-TriPhaseWatch/firmware/board_a/platform/FreeRTOSConfig.h
#ifndef BOARD_A_FREERTOS_CONFIG_H
#define BOARD_A_FREERTOS_CONFIG_H

#include "stm32f4xx.h"

#define configUSE_PREEMPTION 1
#define configUSE_PORT_OPTIMISED_TASK_SELECTION 1
#define configUSE_TICKLESS_IDLE 0
#define configCPU_CLOCK_HZ SystemCoreClock
#define configSYSTICK_CLOCK_HZ SystemCoreClock
#define configTICK_RATE_HZ ((TickType_t)1000)
#define configMAX_PRIORITIES 8
#define configMINIMAL_STACK_SIZE ((uint16_t)128)
#define configTOTAL_HEAP_SIZE ((size_t)0)
#define configMAX_TASK_NAME_LEN 16
#define configUSE_16_BIT_TICKS 0
#define configIDLE_SHOULD_YIELD 1
#define configUSE_MUTEXES 1
#define configUSE_RECURSIVE_MUTEXES 0
#define configUSE_COUNTING_SEMAPHORES 0
#define configUSE_QUEUE_SETS 0
#define configUSE_TASK_NOTIFICATIONS 1
#define configUSE_TRACE_FACILITY 0
#define configUSE_STATS_FORMATTING_FUNCTIONS 0
#define configUSE_TIMERS 0
#define configTIMER_TASK_PRIORITY 0
#define configTIMER_QUEUE_LENGTH 0
#define configTIMER_TASK_STACK_DEPTH 0
#define configUSE_CO_ROUTINES 0
#define configMAX_CO_ROUTINE_PRIORITIES 1
#define configUSE_ALTERNATIVE_API 0
#define configUSE_APPLICATION_TASK_TAG 0
#define configSUPPORT_STATIC_ALLOCATION 1
#define configSUPPORT_DYNAMIC_ALLOCATION 0
#define configCHECK_FOR_STACK_OVERFLOW 2
#define configUSE_MALLOC_FAILED_HOOK 0
#define configUSE_IDLE_HOOK 1
#define configUSE_TICK_HOOK 0
#define configUSE_NEWLIB_REENTRANT 0
#define configNUM_THREAD_LOCAL_STORAGE_POINTERS 0
#define configQUEUE_REGISTRY_SIZE 0
#define configENABLE_BACKWARD_COMPATIBILITY 0
#define configPRIO_BITS 4
#define configLIBRARY_LOWEST_INTERRUPT_PRIORITY 15
#define configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY 5
#define configKERNEL_INTERRUPT_PRIORITY \
  ((uint8_t)(configLIBRARY_LOWEST_INTERRUPT_PRIORITY << (8 - configPRIO_BITS)))
#define configMAX_SYSCALL_INTERRUPT_PRIORITY \
  ((uint8_t)(configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY << \
             (8 - configPRIO_BITS)))

#define INCLUDE_uxTaskGetStackHighWaterMark 1
#define INCLUDE_xTaskGetSchedulerState 1
#define INCLUDE_xTaskGetCurrentTaskHandle 1
#define INCLUDE_vTaskDelay 1
#define INCLUDE_vTaskSuspend 1

void board_a_rtos_assert_failed(const char *file, int line);
#define configASSERT(condition) \
  if ((condition) == 0) {       \
    board_a_rtos_assert_failed(__FILE__, __LINE__); \
  }

#endif /* BOARD_A_FREERTOS_CONFIG_H */
